<template>
  <ve-heatmap :data="chartData"></ve-heatmap>
</template>

<script>
export default {
  data() {
    return {
      chartData: {
        columns: ["时间", "职员", "任务"],
        rows: [
          { 时间: "星期日", 职员: "张三", 任务: 1 },
          { 时间: "星期一", 职员: "张三", 任务: 1 },
          { 时间: "星期二", 职员: "刘二", 任务: 2 },
          { 时间: "星期三", 职员: "李四", 任务: 1 },
          { 时间: "星期四", 职员: "李四", 任务: 1 },
          { 时间: "星期四", 职员: "王五", 任务: 3 },
          { 时间: "星期五", 职员: "王五", 任务: 3 },
          { 时间: "星期六", 职员: "王五", 任务: 3 }
        ]
      }
    };
  }
};
</script>
